Dlubal.RFEM5.RibPositionType
Type of rib position

Dlubal.RFEM5.RibPositionType.UnknownRibPosition
Unknown rib position

Dlubal.RFEM5.RibPositionType.OnPositiveSide
On +z-side of the surface

Dlubal.RFEM5.RibPositionType.OnNegativeSide
On -z-side of the surface

Dlubal.RFEM5.RibPositionType.InCenter
In the center of the surface

Dlubal.RFEM5.RibPositionType.UserDefinedPosition
User-defined via member eccentricity